---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions.#ctor(System.Boolean)
source: html/c80203c8-a028-0df5-a5aa-a0b85350a71a.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions.#ctor Method

Constructor

## Syntax (C#)
```csharp
public FabricationSaveJobOptions(
	bool addHolesForTaps
)
```

## Parameters
- **addHolesForTaps** (`System.Boolean`) - Set true to have holes for taps on straights added to the created fabrication job.